In [95]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
pwd

'/Users/bellaxia/Downloads/UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas'

In [12]:
df = pd.read_csv('example.csv', index_col = 0)

In [13]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [18]:
df.to_csv('newfile.csv',index=False)

In [19]:
new = pd.read_csv('new_file.csv')

In [20]:
new

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [21]:
conda install lxml

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [22]:
url = 'https://en.wikipedia.org/wiki/World_population'

In [48]:
tables = pd.read_html(url)

In [49]:
type(tables)

list

In [50]:
len(tables)

24

In [51]:
tables[0]

,Population,1,2,3,4,5,6,7,8,9,10
0,Year,1804,1930,1960,1974,1987,1999,2011,2022,2037,2057
1,Years elapsed,"200,000+",126,30,14,13,12,12,11,15,20

In [28]:
tables[1].columns

Index(['#', 'Most populous countries', '2000', '2015', '2030[A]'], dtype='object')

In [52]:
world_topten = tables[1]

In [53]:
world_topten

,#,Most populous countries,2000,2015,2030[A]
0,1,China[B],1270,1376,1416
1,2,India,1053,1311,1528
2,3,United States,283,322,356
3,4,Indonesia,212,258,295
4,5,Pakistan,136,208,245
5,6,Brazil,176,206,228
6,7,Nigeria,123,182,263
7,8,Bangladesh,131,161,186
8,9,Russia,146,146,149
9,10,Mexico,103,127,148
10,NaN,World total,6127,7349,8501
11,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...

In [54]:
world_topten = world_topten.drop(11, axis = 0)

In [55]:
world_topten

      # Most populous countries  2000  2015 2030[A]
0     1                China[B]  1270  1376    1416
1     2                   India  1053  1311    1528
2     3           United States   283   322     356
3     4               Indonesia   212   258     295
4     5                Pakistan   136   208     245
5     6                  Brazil   176   206     228
6     7                 Nigeria   123   182     263
7     8              Bangladesh   131   161     186
8     9                  Russia   146   146     149
9    10                  Mexico   103   127     148
10  NaN             World total  6127  7349    8501

In [56]:
world_topten = world_topten.drop('#', axis = 1)

In [57]:
world_topten

   Most populous countries  2000  2015 2030[A]
0                 China[B]  1270  1376    1416
1                    India  1053  1311    1528
2            United States   283   322     356
3                Indonesia   212   258     295
4                 Pakistan   136   208     245
5                   Brazil   176   206     228
6                  Nigeria   123   182     263
7               Bangladesh   131   161     186
8                   Russia   146   146     149
9                   Mexico   103   127     148
10             World total  6127  7349    8501

In [58]:
world_topten = pd.DataFrame(world_topten)

In [59]:
type(world_topten)

pandas.core.frame.DataFrame

In [60]:
world_topten

   Most populous countries  2000  2015 2030[A]
0                 China[B]  1270  1376    1416
1                    India  1053  1311    1528
2            United States   283   322     356
3                Indonesia   212   258     295
4                 Pakistan   136   208     245
5                   Brazil   176   206     228
6                  Nigeria   123   182     263
7               Bangladesh   131   161     186
8                   Russia   146   146     149
9                   Mexico   103   127     148
10             World total  6127  7349    8501

In [61]:
world_topten.columns

Index(['Most populous countries', '2000', '2015', '2030[A]'], dtype='object')

In [62]:
world_topten.columns = ['Country', '2000', '2015', '2030 est']

In [63]:
world_topten

          Country  2000  2015 2030 est
0        China[B]  1270  1376     1416
1           India  1053  1311     1528
2   United States   283   322      356
3       Indonesia   212   258      295
4        Pakistan   136   208      245
5          Brazil   176   206      228
6         Nigeria   123   182      263
7      Bangladesh   131   161      186
8          Russia   146   146      149
9          Mexico   103   127      148
10    World total  6127  7349     8501

In [65]:
tables[6]

    Year  Population Yearly growth           Density(pop/km2)  \
    Year  Population             %    Number Density(pop/km2)
0   1951  2584034261         1.88%  47603112               17
1   1952  2630861562         1.81%  46827301               18
2   1953  2677608960         1.78%  46747398               18
3   1954  2724846741         1.76%  47237781               18
4   1955  2773019936         1.77%  48173195               19
..   ...         ...           ...       ...              ...
65  2016  7464022000         1.14%  84225000               50
66  2017  7547859000         1.12%  83837000               51
67  2018  7631091000         1.10%  83232000               51
68  2019  7713468000         1.08%  82377000               52
69  2020  7795000000         1.05%  81331000               52

   Urban population
             Number    %
0         775067697  30%
1         799282533  30%
2         824289989  31%
3         850179106  31%
4         877008842  32%
..              ...  ...
65       4060653000  54%
66       4140189000  55%
67       4219817000  55%
68       4299439000  56%
69       4378900000  56%

[70 rows x 7 columns]

In [77]:
world_topten.to_html('sample_table.html', index = False)

In [78]:
wb = pd.ExcelFile('my_excel_file.xlsx')

In [79]:
wb.sheet_names

['First_Sheet']

In [83]:
excel_sheet_dict = pd.read_excel('my_excel_file.xlsx', sheet_name = None)

In [84]:
excel_sheet_dict

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [85]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [87]:
excel_sheet_dict['First_Sheet']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [88]:
df = excel_sheet_dict['First_Sheet']

In [89]:
type(df)

pandas.core.frame.DataFrame

In [91]:
df.to_excel('example.xlsx', sheet_name = 'First_Sheet', index = False)

In [92]:
from sqlalchemy import create_engine

In [93]:
temp_db = create_engine('sqlite:///:memory;')

In [98]:
pd.DataFrame(data = np.random.randint(low=0, high=100, size=(4,4)), columns = ['a', 'b', 'c', 'd'])

    a   b   c   d
0  30   5  51  23
1  60  50  24  22
2  10  42  55  96
3  54  82  81  82

In [104]:
df.to_sql(name='newly_table', con=temp_db, index=False)

4

In [105]:
new_df = pd.read_sql(sql='newly_table', con=temp_db)

In [106]:
new_df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [107]:
pd.read_sql_query(sql='SELECT a,c FROM newly_table', con = temp_db)

    a   c
0   0   2
1   4   6
2   8  10
3  12  14